NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG24/EFR32BG24A020F1024IM48.svd
        <register>
          <name>DPLLREFCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DPLLREFCLK is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking DPLLREFCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking DPLLREFCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN0</name>
                  <description>CLKIN0 is clocking DPLLREFCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking EM01GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking EM01GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking EM01GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking EM01GRPACLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01GRPCCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking EM01GRPCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking EM01GRPCCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking EM01GRPCCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking EM01GRPCCLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EM23GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EM23GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking EM23GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EM4GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EM4GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking EM4GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IADCCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EM01GRPACLK</name>
                  <description>EM01GRPACLK is clocking IADCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking IADCCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking IADCCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOG0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking WDOG0CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking WDOG0CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking WDOG0CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLKDIV1024</name>
                  <description>HCLKDIV1024 is clocking WDOG0CLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOG1CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking WDOG0CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking WDOG0CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking WDOG0CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLKDIV1024</name>
                  <description>HCLKDIV1024 is clocking WDOG0CLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EUSART0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x220</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>EUSART0 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM01GRPCCLK</name>
                  <description>EM01GRPCCLK is clocking EUSART0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking EUSART0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EUSART0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EUSART0</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSRTC0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking SYSRTC0CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking SYSRTC0CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking SYSRTC0CLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>VDAC is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM01GRPACLK</name>
                  <description>EM01GRPACLK is clocking VDAC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM23GRPACLK</name>
                  <description>EM23GRPACLK is clocking VDAC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking VDAC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking VDAC</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PCNT0 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM23GRPACLK</name>
                  <description>EM23GRPACLK is clocking PCNT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCNTS0</name>
                  <description>External pin PCNT_S0 is clocking PCNT0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIOCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGCLK</name>
              <description>Enable Clock for Debugger</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC1CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x294</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>VDAC is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM01GRPACLK</name>
                  <description>EM01GRPACLK is clocking VDAC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM23GRPACLK</name>
                  <description>EM23GRPACLK is clocking VDAC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking VDAC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking VDAC</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
